dragonman225/stm32f469-usbaudio/Middlewares/ST/STM32_USB_Device_Library/Class/AUDIO/Src/usbd_audio.c
    /* Calculate remaining writable buffer size */
    if (haudio->rd_ptr < haudio->wr_ptr) {
      audio_buf_writable_size = haudio->rd_ptr + AUDIO_TOTAL_BUF_SIZE - haudio->wr_ptr;
    } else {
      audio_buf_writable_size = haudio->rd_ptr - haudio->wr_ptr;
    }

    /* Monitor remaining writable buffer size with LED */
    if (audio_buf_writable_size < AUDIO_BUF_SAFEZONE) {
      BSP_LED_On(LED2);
    } else {
      BSP_LED_Off(LED2);
    }

    sof_count += 1;

    if (sof_count == 1U) {
      sof_count = 0;
      /* Calculate feedback value based on the change of writable buffer size */
      /* v2 */
      int32_t audio_buf_writable_size_dev_from_nom;
      audio_buf_writable_size_dev_from_nom = audio_buf_writable_size - (AUDIO_TOTAL_BUF_SIZE >> 1);
      // fb_value += audio_buf_writable_size_dev_from_nom * 1352;
      fb_value += audio_buf_writable_size_dev_from_nom * audio_buf_writable_size_dev_from_nom / 912673 * 128 * audio_buf_writable_size_dev_from_nom;
      /* v1 */
      // int32_t audio_buf_writable_size_change;
      // audio_buf_writable_size_change = audio_buf_writable_size - audio_buf_writable_size_last;
      // fb_raw += audio_buf_writable_size_change * 0x1000;
      // fb_value = (uint32_t)fb_raw;

      /* Update last writable buffer size */
      audio_buf_writable_size_last = audio_buf_writable_size;

      /* Check feedback max / min */
      if (fb_value > fb_nom + AUDIO_FB_DELTA) {
        fb_value = fb_raw = fb_nom + AUDIO_FB_DELTA;
      } else if (fb_value < fb_nom - AUDIO_FB_DELTA) {
        fb_value = fb_raw = fb_nom - AUDIO_FB_DELTA;
      }

      /* Set 10.14 format feedback data */
      /**
       * Order of 3 bytes in feedback packet: { LO byte, MID byte, HI byte }
       * 
       * For example,
       * 48.000(dec) => 300000(hex, 8.16) => 0C0000(hex, 10.14) => packet { 00, 00, 0C }
       * 
       * Note that ALSA accepts 8.16 format.
       */
      fb_data[0] = (fb_value & 0x0000FF00) >> 8;
      fb_data[1] = (fb_value & 0x00FF0000) >> 16;
      fb_data[2] = (fb_value & 0xFF000000) >> 24;
    }

    /* Transmit feedback only when the last one is transmitted */
    if (tx_flag == 0U) {
      /* Get FNSOF. Use volatile for fnsof_new since its address is mapped to a hardware register. */
      USB_OTG_GlobalTypeDef* USBx = USB_OTG_FS;
      uint32_t USBx_BASE = (uint32_t)USBx;
      uint32_t volatile fnsof_new = (USBx_DEVICE->DSTS & USB_OTG_DSTS_FNSOF) >> 8;

      if ((fnsof & 0x1) == (fnsof_new & 0x1)) {
        USBD_LL_Transmit(pdev, AUDIO_IN_EP, (uint8_t*)fb_data, 3U);
        /* Block transmission until it's finished. */
        tx_flag = 1U;
      }
    }
  }

  return USBD_OK;
}

/**
  * @brief  USBD_AUDIO_Sync
  *         handle Sync event called from usbd_audio_if.c
  * @param  pdev: device instance
  * @retval status
  */
void USBD_AUDIO_Sync(USBD_HandleTypeDef* pdev, AUDIO_OffsetTypeDef offset)
{
}

/**
 * !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
 * USBD_AUDIO_IsoINIncomplete & USBD_AUDIO_IsoOutIncomplete are not 
 * enabled by default.
 * 
 * Go to Middlewares/ST/STM32_USB_Device_Library/Core/Src/usbd_core.c
 * Fill in USBD_LL_IsoINIncomplete and USBD_LL_IsoOUTIncomplete with 
 * actual handler functions.
 * !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
 */

/**
  * @brief  USBD_AUDIO_IsoINIncomplete
  *         handle data ISO IN Incomplete event
  * @param  pdev: device instance
  * @param  epnum: endpoint index
  * @retval status
  */
static uint8_t USBD_AUDIO_IsoINIncomplete(USBD_HandleTypeDef* pdev, uint8_t epnum)
{
  USB_OTG_GlobalTypeDef* USBx = USB_OTG_FS;
  uint32_t USBx_BASE = (uint32_t)USBx;
  fnsof = (USBx_DEVICE->DSTS & USB_OTG_DSTS_FNSOF) >> 8;

  if (tx_flag == 1U) {
    tx_flag = 0U;
    USBD_LL_FlushEP(pdev, AUDIO_IN_EP);
  }

  return USBD_OK;
}

/**
  * @brief  USBD_AUDIO_IsoOutIncomplete
  *         handle data ISO OUT Incomplete event
  * @param  pdev: device instance
  * @param  epnum: endpoint index
  * @retval status
  */
static uint8_t USBD_AUDIO_IsoOutIncomplete(USBD_HandleTypeDef* pdev, uint8_t epnum)
{
  return USBD_OK;
}

/**
  * @brief  USBD_AUDIO_DataOut
  *         handle data OUT Stage
  * @param  pdev: device instance
  * @param  epnum: endpoint index
  * @retval status
  */
static uint8_t USBD_AUDIO_DataOut(USBD_HandleTypeDef* pdev,
                                  uint8_t epnum)
{
  USBD_AUDIO_HandleTypeDef* haudio;
  haudio = (USBD_AUDIO_HandleTypeDef*)pdev->pClassData;

  static uint8_t tmpbuf[1024];

  if (all_ready == 1U && epnum == AUDIO_OUT_EP) {
    uint32_t curr_length = USBD_GetRxCount(pdev, epnum);

    /* Ignore strangely large packets */
    if (curr_length > AUDIO_OUT_PACKET_24B) {
      curr_length = 0U;
    }

    uint32_t num_of_samples = 0U;
    uint32_t i, tmpbuf_ptr = 0U;
    if (haudio->bit_depth == 16U) {
      num_of_samples = curr_length / 4;
    } else {
      num_of_samples = curr_length / 6;
    }

    for (i = 0; i < num_of_samples; i++) {
      /**
       * tmpbuf byte order (USB is little-endian):
       * 16-bit sample { 0: L_LOBYTE, 1: L_HIBYTE, 2: R_LOBYTE, 3: R_HIBYTE }
       * 24-bit sample { 0: L_LOBYTE, 1: L_MDBYTE, 2: L_HIBYTE, 3: R_LOBYTE, 4: R_MDBYTE, 5: R_HIBYTE }
       * 
       * audio frame byte order (32-bit frame, LSB-Justified):
       * 16-bit { 0:   0x00, 1: LOBYTE, 2: HIBYTE, 3: 0x00 }
       * 24-bit { 0: LOBYTE, 1: MDBYTE, 2: HIBYTE, 3: 0x00 }
       * 
       * DMA example: (assume there's a frame in memory { 0x56, 0x34, 0x12, 0x00 })
       * - ARM is little-endian.
       * SAI reg width is 32-bit, the frame need 1 DMA transfer: 0x00123456.
       * - Since SAI DataSize is 24-bit, 0x123456 is sent.
       * I2S reg width is 16-bit, the frame need 2 DMA transfers: First, 0x3456. Then, 0x0012.
       * - Since I2S DataFormat is 24-bit, Standard is LSB, 0x560012 is sent.
       * - If we want to send 0x123456, we need to change the half-word order in memory!
       */
      /* Copy one sample */
      if (haudio->bit_depth == 16U) {
        /* SAI */
        haudio->buffer[haudio->wr_ptr++] = (uint16_t)(tmpbuf[tmpbuf_ptr] << 8);
        haudio->buffer[haudio->wr_ptr++] = (uint16_t)(tmpbuf[tmpbuf_ptr + 1]);
        haudio->buffer[haudio->wr_ptr++] = (uint16_t)(tmpbuf[tmpbuf_ptr + 2] << 8);
        haudio->buffer[haudio->wr_ptr++] = (uint16_t)(tmpbuf[tmpbuf_ptr + 3]);

        /* I2S */
        // haudio->buffer[haudio->wr_ptr++] = (uint16_t)(tmpbuf[tmpbuf_ptr + 1]);
        // haudio->buffer[haudio->wr_ptr++] = (uint16_t)(tmpbuf[tmpbuf_ptr] << 8);
        // haudio->buffer[haudio->wr_ptr++] = (uint16_t)(tmpbuf[tmpbuf_ptr + 3]);
        // haudio->buffer[haudio->wr_ptr++] = (uint16_t)(tmpbuf[tmpbuf_ptr + 2] << 8);

